/* Задача 14

Дано число `n=1000`. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится?
Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную `num`. */

//Рішення:
// За допомогою циклу виконувати ділення числа на два, перезаписуючи його, поки число < 50, вивести його. і порахувати 
// кількість ітерацій і записати їх кількість в num.
let n = 1000;
function spleatN () {
      for (let newN = n; newN > 50; n / 2) {
           n = newN;
      }
 }
 spleatN()