/* Задача 9

Отсортировать массив по убыванию.

```javascript
var arr = [1,2,3,4,5,6];
// [6,5,4,3,2,1]
```

**Внимание**!

- Не разрашается использовать специальные методы массивов. */
var arr = [1, 2, 3, 4, 5, 6];
//var arr = [3, 1, 2, 7, 5, 6, 4];
function bubbleSortArr (arr) {
     for (let n = 0; n < arr.length; n++) {//необхідне для повторення ітерації щоб можна було порівняти решту данних по колу, так як за один цикл що порівнюється одне значення з усіма треба ітерацій менше ніж є чисел в масиві.
          for (let i = 0; i < arr.length - 1 - n; i++) {// - 1 - n  це для того, щоб не сортувати вже відсортоване(ні) значення з ітерацію 
               if (arr[i] < arr[i + 1]) {// для порівняння перших двух значень мжі собою і якщо перше менше то перемістити на місце другого, і так далі наступні два значення (2 і 3 значення по порядку (з 1 і 2 індексом у масиві))
                    const buff = arr[i]
                    arr[i] = arr[i + 1]
                    arr[i + 1] = buff
               }
           }
     }

     console.log(arr)
}
bubbleSortArr(arr);
